init_el.org
:PROPERTIES:
:ID:       52F81E86-D8C4-4A74-B8C4-EE0A32CA7100
:END:
#+title: init.el

* 背景
  =spacemacs= 入坑，经过大约三四年的使用，终于可以算是摸到了门槛。之前一直使用 =evil= 来模拟 vim 模式，随着使用的时间越长，依赖的插件越多，evil 带来的弊端也逐渐显现出来：
  - 每一个插件除非有支持，不然都需要自定义按键，配合双 leader 系统，任务繁重。。。
  - 对于不同的 mode-map 可能有相同的按键映射，emasc 采用 =1 major + n minor= 模式，很容易产生按键冲突
  - 过重

  让我萌生了更换输入模式的想法。此时恰巧看到了[[https://emacs-china.org/t/meow/15679][猫态编辑：Meow - Emacs-general - Emacs China]] 这个模式，被描述吸引，决定尝试。

  同时经过几年的使用，逐渐对原有在 =懵懂= 状态下进行的配置有了重构之心，故借此机会，同时使用 org-mode ，尽可能记录下配置生成的点点滴滴。

  Meow 尝试失败，退回 evil 模式，但使用 god-mode 作为辅助。
** 使用 org mode 记录配置
   很多人使用 emacs 都是因为 org mode 入的坑，可见其厉害之处。本篇记录使用 =org-tangle= 将包含的 source block 依序拼接(=tangle=)为一个文件。这里默认会导出为 org 文件的同名文件，需要设置。

   #+begin_src emacs-lisp :tangle no
     :PROPERTIES:
     :header-args: :tangle "~/.emacs.d/init.el"
     :END:
   #+end_src

   此处我们直接输出配置到 =~/.emacs.d/init.el= 文件，意味着需要手动更新输出，新配置才可能生效。当然也可以直接更改此文件，但在下次导出时，会被覆盖，所以请不要这么做。

* 基础设置

** 连接到 Center 服务器修改 ansible 脚本
#+begin_src emacs-lisp
  (defun goto-ansible ()
    (interactive)
    (find-file "/sshx:192.168.2.54:"))
#+end_src

** 设置 gpg
#+begin_src emacs-lisp
  (setq epa-pinentry-mode 'loopback)
#+end_src
** 为 evil 设置 eval-last-sexp
#+begin_src emacs-lisp
  (defun evil/eval-last-sexp (arg)
    (interactive "P")
    (evil-set-marker ?8)
    (sp-end-of-sexp)
    (eval-last-sexp arg)
    (evil-goto-mark ?8))

  (global-set-key (kbd "C-x C-e") 'evil/eval-last-sexp)
#+end_src
** 窗口最大化
   #+begin_src emacs-lisp
     (global-set-key (kbd "<C-s-268632070>") 'toggle-frame-fullscreen)
     (global-set-key (kbd "s-C-f") 'toggle-frame-fullscreen)
     (global-set-key (kbd "s-M-f") 'toggle-frame-maximized)
   #+end_src

** 设置方法快速进入此文件
   #+begin_src emacs-lisp
     (defun goto-configuration-org ()
       (interactive)
       (find-file "~/.emacs.d/init_el.org"))
   #+end_src
** 加速启动时间的技巧
   通过设置最大垃圾回收大小，在启动过程中避免垃圾回收；在启动之后，设置为 300mb 以减少垃圾回收启动频率。
   #+begin_src emacs-lisp
     (setq gc-cons-threshold most-positive-fixnum)
     (add-hook 'after-init-hook '(lambda () (setq gc-cons-threshold 5121024)))
   #+end_src
** 增加从进程读取消息的大小
   因为 lsp-mode 需要更改此大小。
   #+begin_src emacs-lisp
     (setq read-process-output-max (* 3 (* 1024 1024))) ;; 3mb
   #+end_src
** 计算启动时间
 #+begin_src emacs-lisp
   (setq emacs-start-time (current-time))
   (add-hook 'window-setup-hook '(lambda ()
                                   (message
                                    (format "Emacs startup in %.3f seconds"
                                            (float-time
                                             (time-subtract
                                              (current-time)
                                              emacs-start-time))))))
 #+end_src
** 编译设置
 #+begin_src emacs-lisp
   (setq comp-async-jobs-number 5
         comp-deferred-compilation t
         native-comp-async-report-warnings-errors nil)
 #+end_src
** 系统及文件夹路径设置
 #+begin_src emacs-lisp
   (setq private/cache-directory "~/.emacs.d/.cache/"
	 private/system-is-mac (eq system-type 'darwin)
	 private/config-directory "~/.emacs.d/"
)
   (add-to-list 'load-path (concat private/config-directory "helpers/"))
 #+end_src
** 自定义文件及载入设置
 #+begin_src emacs-lisp
   (setq custom-file "~/.emacs.d/custom.el")
   (if (file-exists-p custom-file)
       (load custom-file)
     (message "no custom setting file!"))
 #+end_src
** 当光标滚动超出屏幕的时候，不再使目标行居中
  #+begin_src emacs-lisp
    (setq scroll-conservatively 101
          scroll-preserve-screen-position t)
  #+end_src
** 不再有提示音
  #+begin_src emacs-lisp
    (setq ring-bell-function 'ignore)
  #+end_src
** 替换 yes no
   #+begin_src emacs-lisp
     (fset 'yes-or-no-p 'y-or-n-p)
   #+end_src
** 编辑相关设置
   #+begin_src emacs-lisp
     (set-default-coding-systems 'utf-8-unix)
     (add-hook 'before-save-hook 'delete-trailing-whitespace)
     (setq tab-width 2
           indent-tabs-mode nil
           auto-save-default nil
           make-backup-files nil
           create-lockfiles nil
           x-select-enable-clipboard nil)
   #+end_src
** 翻墙（虽然一般不怎么用）
   #+begin_src emacs-lisp
     (defun goproxy()
       (interactive)
       (setq url-proxy-services '(("no_proxy" . "^\\(localhost\\|10\\..*\\|192\\.168\\..*\\)")
                                  ("http" . "192.168.50.111:8118")
                                  ("https" . "192.168.50.111:8118"))))

     (defun disproxy()
       (interactive)
       (setq url-proxy-services nil))
   #+end_src
** mac 修饰键配置
   #+begin_src emacs-lisp
     (setq ns-command-modifier 'super
           ns-option-modifer 'meta
           ns-right-option-modifier 'hyper
           ns-right-command-modifier 'hyper)
   #+end_src
** 退出时不询问是否关闭进程
#+begin_src emacs-lisp
  (setq confirm-kill-processes nil)
#+end_src

** 移除 org-mode
#+begin_src emacs-lisp
  ;; (assq-delete-all 'org package--builtins)
  ;; (assq-delete-all 'org package--builtin-versions)
#+end_src
* 包管理
  我们使用 [[https://github.com/jwiegley/use-package][jwiegley/use-package]] 进行 melpa 包管理，同时配合 [[https://github.com/quelpa/quelpa][quelpa/quelpa]] 进行源码包管理（含 github），并使用 [[https://github.com/Silex/package-utils][Silex/package-utils]] 提供 helper 方便使用。

#+begin_src emacs-lisp
  (setq package-native-compile t
	use-package-expand-minimally t
	use-package-always-ensure t
	package-enable-at-startup nil
	package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("nongnu"   . "https://elpa.nongnu.org/nongnu/")
			   ("gnu"   . "https://elpa.gnu.org/packages/")))
  ;; This is only needed once, near the top of the file
  (eval-when-compile
    (require 'use-package))

  (use-package use-package-ensure-system-package
    :ensure t)

  ;; disable update during quelpa initialized
  (setq quelpa-update-melpa-p nil
	quelpa-checkout-melpa-p t)

  ;; install quelpa
  (unless (package-installed-p 'quelpa)
    (with-temp-buffer
      (url-insert-file-contents "https://raw.githubusercontent.com/quelpa/quelpa/master/quelpa.el")
      (eval-buffer)
      (quelpa-self-upgrade)))

  ;; install quelpa-use-package
  (quelpa
   '(quelpa-use-package
     :fetcher git
     :url "https://github.com/quelpa/quelpa-use-package.git"))

  (require 'quelpa-use-package)
  (quelpa-use-package-activate-advice)

  ;;(use-package benchmark-init
  ;;  :config
  ;;  (add-hook 'after-init-hook 'benchmark-init/deactivate))

  (use-package package-utils
    :defer t)
#+end_src
* 环境变量
  #+begin_src emacs-lisp
    (use-package exec-path-from-shell
      :config
      (exec-path-from-shell-initialize))
  #+end_src
* 按键管理
** Evil
经过 Meow 的试用，还是决定退回 evil 了。。。
#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-shift-width 2
          evil-flash-delay 1
          evil-undo-system 'undo-redo
          evil-want-integration t
          evil-want-keybinding nil
          evil-cross-lines t)
    (evil-mode)
    :config
    (evil-set-initial-state 'calibredb-search-mode 'emacs)
    (evil-set-initial-state 'custom-mode 'emacs)
    (evil-set-initial-state 'code-review-mode 'emacs)
    (evil-set-initial-state 'ivy-occur-grep-mode 'normal)
    (with-eval-after-load 'evil-maps (define-key evil-motion-state-map (kbd "TAB") nil))
    (defun copy-to-clipboard()
      "Copies selection to x-clipboard."
      (interactive)
      (if (display-graphic-p)
          (progn
            (if (use-region-p)
                (progn
                  (evil-yank (region-beginning) (region-end) t (evil-use-register ?+))
                  (message "Yanked region to clipboard!")
                  (deactivate-mark))
              (message "No region active; can't yank to clipboard!"))
            )))

    (defun paste-from-clipboard ()
      "Pastes from x-clipboard."
      (interactive)
      (evil-paste-from-register (evil-use-register ?+)))

    (general-define-key
     :states 'insert
     "\C-h" 'delete-backward-char
     "\C-d" 'delete-char)
    ;; (general-define-key
    ;;  "s-c" 'copy-to-clipboard
    ;;  "s-v" 'paste-from-clipboard)
    (mapc #'evil-declare-ignore-repeat
          '(kill-this-buffer
            ido-kill-buffer
            save-buffer
            split-window-below
            split-window-below-and-focus
            split-window-right
            split-window-right-and-focus
            switch-window)))
#+end_src

** 绑定
  +meow 提供了一些全局的绑定方法，但基本均基于 normal state 或者 leader key ，无法根据 keymap 设置按键，故引入 general 。+
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-create-definer common-leader
      :prefix-name "SPC"
      :keymaps 'override
      :non-normal-prefix "C-SPC"
      :prefix "SPC"
      :states '(insert motion normal emacs))
    (general-create-definer local-leader
      :prefix-name "leader"
      :non-normal-prefix "C-,"
      :prefix ","
      :states '(insert motion normal emacs))
    (general-evil-setup)
    (general-auto-unbind-keys)
       (general-create-definer clear-spc
         :prefix-name "NOSPC"
         "SPC" nil)
    (common-leader
      "fed" 'goto-configuration-org
      "SPC" 'counsel-M-x))
#+end_src
** 提示
  keypad 模式由 meow 自己提供按键提示，其他提示由 which-key 提供。
#+begin_src emacs-lisp
  (use-package which-key
    :after god-mode
    :init
    (add-hook 'after-init-hook 'which-key-mode)
    :config
    (which-key-enable-god-mode-support))
#+end_src
** 按键及方法显示
   [[https://github.com/lewang/command-log-mode][lewang/command-log-mode: log commands to buffer]]
#+begin_src emacs-lisp
  (use-package command-log-mode
    :defer t
    :commands (command-log-mode))
#+end_src

** 注释
#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :commands (evilnc-comment-or-uncomment-lines)
    :config
    (evilnc-default-hotkeys)
    :general
    (common-leader
      "gc" 'evilnc-comment-or-uncomment-lines))
#+end_src

