init.el
(defun goto-ansible ()
  (interactive)
  (find-file "/sshx:192.168.2.54:"))

(defun evil/eval-last-sexp (arg)
  (interactive "P")
  (evil-set-marker ?8)
  (sp-end-of-sexp)
  (eval-last-sexp arg)
  (evil-goto-mark ?8))

(global-set-key (kbd "C-x C-e") 'evil/eval-last-sexp)

(global-set-key (kbd "<C-s-268632070>") 'toggle-frame-fullscreen)
(global-set-key (kbd "s-C-f") 'toggle-frame-fullscreen)
(global-set-key (kbd "s-M-f") 'toggle-frame-maximized)

(defun goto-configuration-org ()
  (interactive)
  (find-file "~/.emacs.d/init_el.org"))

(setq gc-cons-threshold most-positive-fixnum)
(add-hook 'after-init-hook '(lambda () (setq gc-cons-threshold 5121024)))

(setq read-process-output-max (* 3 (* 1024 1024))) ;; 3mb

(setq emacs-start-time (current-time))
(add-hook 'window-setup-hook '(lambda ()
                                (message
                                 (format "Emacs startup in %.3f seconds"
                                         (float-time
                                          (time-subtract
                                           (current-time)
                                           emacs-start-time))))))

(setq comp-async-jobs-number 5
      comp-deferred-compilation t
      native-comp-async-report-warnings-errors nil)

(setq private/cache-directory "~/.emacs.d/.cache/"
	 private/system-is-mac (eq system-type 'darwin)
	 private/config-directory "~/.emacs.d/"
)
   (add-to-list 'load-path (concat private/config-directory "helpers/"))

(setq custom-file "~/.emacs.d/custom.el")
(if (file-exists-p custom-file)
    (load custom-file)
  (message "no custom setting file!"))

(setq scroll-conservatively 101
      scroll-preserve-screen-position t)

(setq ring-bell-function 'ignore)

(fset 'yes-or-no-p 'y-or-n-p)

(set-default-coding-systems 'utf-8-unix)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(setq tab-width 2
      indent-tabs-mode nil
      auto-save-default nil
      make-backup-files nil
      create-lockfiles nil
      x-select-enable-clipboard nil)

(defun goproxy()
  (interactive)
  (setq url-proxy-services '(("no_proxy" . "^\\(localhost\\|10\\..*\\|192\\.168\\..*\\)")
                             ("http" . "192.168.50.111:8118")
                             ("https" . "192.168.50.111:8118"))))

(defun disproxy()
  (interactive)
  (setq url-proxy-services nil))

(setq ns-command-modifier 'super
      ns-option-modifer 'meta
      ns-right-option-modifier 'hyper
      ns-right-command-modifier 'hyper)

(setq confirm-kill-processes nil)

(assq-delete-all 'org package--builtins)
(assq-delete-all 'org package--builtin-versions)

(setq package-native-compile t
      use-package-expand-minimally t
      use-package-always-ensure t
      package-enable-at-startup nil
      package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("nongnu"   . "https://elpa.nongnu.org/nongnu/")
			 ("gnu"   . "https://elpa.gnu.org/packages/")))
;; This is only needed once, near the top of the file
(eval-when-compile
  (require 'use-package))

(use-package use-package-ensure-system-package
  :ensure t)

;; disable update during quelpa initialized
(setq quelpa-update-melpa-p nil
      quelpa-checkout-melpa-p t)

;; install quelpa
(unless (package-installed-p 'quelpa)
  (with-temp-buffer
    (url-insert-file-contents "https://raw.githubusercontent.com/quelpa/quelpa/master/quelpa.el")
    (eval-buffer)
    (quelpa-self-upgrade)))

;; install quelpa-use-package
(quelpa
 '(quelpa-use-package
   :fetcher git
   :url "https://github.com/quelpa/quelpa-use-package.git"))

(require 'quelpa-use-package)
(quelpa-use-package-activate-advice)

;;(use-package benchmark-init
;;  :config
;;  (add-hook 'after-init-hook 'benchmark-init/deactivate))

(use-package package-utils
  :defer t)

(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-initialize))

(use-package evil
  :init
  (setq evil-shift-width 2
	evil-flash-delay 1
	evil-want-integration nil
	evil-undo-system 'undo-redo
	evil-want-integration t
	evil-want-keybinding nil)
  (evil-mode)				;
  :config
  (defun copy-to-clipboard()
    "Copies selection to x-clipboard."
    (interactive)
    (if (display-graphic-p)
	(progn
	  (if (use-region-p)
	      (progn
		(evil-yank (region-beginning) (region-end) t (evil-use-register ?+))
		(message "Yanked region to clipboard!")
		(deactivate-mark))
	    (message "No region active; can't yank to clipboard!"))
	  )
      ))

  (defun paste-from-clipboard ()
    "Pastes from x-clipboard."
    (interactive)
    (evil-paste-after 1 (evil-use-register ?+))
    )
  (general-define-key
   :states 'insert
   "\C-h" 'delete-backward-char
   "\C-d" 'delete-char)
  (general-define-key
   "s-c" 'copy-to-clipboard
   "s-v" 'paste-from-clipboard)
  (mapc #'evil-declare-ignore-repeat
	'(kill-this-buffer
	  ido-kill-buffer
	  save-buffer
	  split-window-below
	  split-window-below-and-focus
	  split-window-right
	  split-window-right-and-focus
	  switch-window)))

(use-package general
  :config
  (general-create-definer common-leader
    :prefix-name "SPC"
    :keymaps 'override
    :non-normal-prefix "C-SPC"
    :prefix "SPC"
    :states '(insert motion normal emacs))
  (general-create-definer local-leader
    :prefix-name "leader"
    :non-normal-prefix "C-,"
    :prefix ","
    :states '(insert motion normal emacs))
  (general-evil-setup)
  (general-auto-unbind-keys)
     (general-create-definer clear-spc
       :prefix-name "NOSPC"
       "SPC" nil)
  (common-leader
    "fed" 'goto-configuration-org
    "SPC" 'counsel-M-x))

(use-package which-key
  :after god-mode
  :init
  (add-hook 'after-init-hook 'which-key-mode)
  :config
  (which-key-enable-god-mode-support))

(use-package command-log-mode
  :defer t
  :commands (command-log-mode))

(use-package evil-nerd-commenter
  :commands (evilnc-comment-or-uncomment-lines)
  :config
  (evilnc-default-hotkeys)
  :general
  (common-leader
    "gc" 'evilnc-comment-or-uncomment-lines))
