init_el.org
** 其他 Evil 相关
#+begin_src emacs-lisp
  (use-package evil-matchit
    :hook (prog-mode . evil-matchit-mode))

  (use-package evil-surround
    :after evil
    :config (global-evil-surround-mode t)
    :general
    (general-define-key
     :states 'motion
     "s" 'evil-surround-region))

  (use-package evil-embrace
    :after evil-surround
    :config
    (evil-embrace-enable-evil-surround-integration))

  (use-package evil-visualstar
    :after evil
    :init
    (global-evil-visualstar-mode)
    :config
    (setq evil-visualstar/persistent t))
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src

** 快捷键辅助 god-mode
#+begin_src emacs-lisp
  (use-package god-mode
    :config
    (setq god-mode-alist '((nil . "C-") ("m" . "M-") ("G" . "C-M-")))
    (evil-define-key 'god global-map "<escape>" 'evil-god-state-bail))

  (defun private/god-start ()
    (interactive)
    (evil-execute-in-god-state)
    (god-mode-self-insert))

  (use-package evil-god-state
    :general
    (common-leader
      "c" 'private/god-start
      "x" 'private/god-start
      "m" 'private/god-start
      "G" 'private/god-start))
#+end_src
* 外观
** modeline
#+begin_src emacs-lisp :tangle no
  (defun my-doom-modeline--font-height ()
    "Calculate the actual char height of the mode-line."
    (+ (frame-char-height) 2))

  (use-package doom-modeline
    :init
    (add-hook 'after-init-hook (lambda ()
				 (doom-modeline-mode)
				 (column-number-mode)
				 (doom-modeline-def-modeline 'my-line
				   '(bar workspace-name modals buffer-info buffer-position)
				   '(input-method checker major-mode parrot lsp))
				 (defun setup-custom-doom-modeline ()
				   (interactive)
				   (doom-modeline-set-modeline 'my-line 'default))
				 (setup-custom-doom-modeline)))
    :config
    (advice-add 'doom-modeline--font-height :override 'my-doom-modeline--font-height)
    ;; (set-face-attribute 'mode-line nil :height 100)
    ;; (set-face-attribute 'mode-line-inactive nil :height 100)
    (setq doom-modeline-buffer-modification-icon nil
	  doom-modeline-buffer-state-icon nil
	  doom-modeline-buffer-file-name-style 'file-name))
#+end_src
#+begin_src emacs-lisp
  (use-package spaceline
    :init
    (setq powerline-image-apple-rgb t
	  powerline-height 24
	  spaceline-buffer-size-p nil
	  spaceline-evil-state-p t
	  spaceline-flycheck-error-p t
	  spaceline-flycheck-warning-p t
	  spaceline-flycheck-info-p t
	  spaceline-minor-modes-p nil
	  spaceline-anzu-p t
	  spaceline-projectile-root-p nil
	  spaceline-version-control-p nil
	  spaceline-org-pomodoro-p nil
	  powerline-default-separator 'box
	  spaceline-separator-dir-left '(right . right)
	  spaceline-separator-dir-right '(left . left)
	  spaceline-highlight-face-func 'spaceline-highlight-face-evil-state
	  spaceline-workspace-numbers-unicode t)
    (add-hook 'after-init-hook #'spaceline-emacs-theme))
#+end_src

#+begin_src emacs-lisp
  (use-package evil-anzu
    :init
    (global-anzu-mode +1)
    (setq anzu-cons-mode-line-p nil))
#+end_src
** theme
#+begin_src emacs-lisp
  (use-package doom-themes
    :init
    (setq doom-themes-enable-bold t
	  doom-themes-enable-italic t)
    (defun load-doom-theme (frame)
      (select-frame frame)
      (load-theme 'doom-one t))
    (if (daemonp)
	(add-hook 'after-make-frame-functions 'load-doom-theme)
      (load-theme 'doom-one t)))
#+end_src

** 关闭滚动条和工具条
   #+begin_src emacs-lisp
     (scroll-bar-mode -1)
     (tool-bar-mode -1)
   #+end_src

** 小猫咪 nyan-mode
#+begin_src emacs-lisp
  (use-package nyan-mode
    :init
    (add-hook 'after-init-hook 'nyan-mode))
#+end_src
** 彩色括号及高亮TODO
   #+begin_src emacs-lisp
     (use-package rainbow-delimiters
       :hook (prog-mode . rainbow-delimiters-mode))

     (use-package hl-todo
       :hook (prog-mode . hl-todo-mode))
   #+end_src
** posframe
   #+begin_src emacs-lisp
     (use-package posframe
       :defer t)
   #+end_src
** 不显示欢迎界面
   #+begin_src emacs-lisp
     (setq inhibit-startup-screen t)
   #+end_src
** 显示 region 中的空格和 tab
本身是有个模式可以全局显示空格和 tab 的，但是平时也不怎么用不到，也丑，就先算了。。。现在发现了一个只针对 region 显示的，感觉应该挺好用的。。。

发现他会影响 evil 的粘贴行为，导致 =yy= + =p= 会在光标处粘贴，而非另起新行，所以先移除。
#+begin_src emacs-lisp :tangle no
  (use-package whitespace4r
    :quelpa (whitespace4r :fetcher github :repo "twlz0ne/whitespace4r.el" :branch "main")
    :init
    (whitespace4r-mode))
#+end_src

#+RESULTS:
: whitespace4r

* 窗口管理
  因为 centaur tabs 有点问题，所以先禁止掉。
  快捷键设置向 item 靠拢。
   #+begin_src emacs-lisp :tangle no
     (use-package centaur-tabs
       :defer t
       :config
       (general-define-key
        "s-1" 'centaur-tabs-select-visible-tab
        "s-2" 'centaur-tabs-select-visible-tab
        "s-3" 'centaur-tabs-select-visible-tab
        "s-4" 'centaur-tabs-select-visible-tab
        "s-5" 'centaur-tabs-select-visible-tab
        "s-6" 'centaur-tabs-select-visible-tab
        "s-7" 'centaur-tabs-select-visible-tab
        "s-t" 'centaur-tabs--create-new-tab)
       (centaur-tabs-mode t)
       (setq centaur-tabs-height 20
             centaur-tabs-set-bar 'left
             centaur-tabs-close-button "x"
             centaur-tabs-set-close-button nil
             ;;centaur-tabs--buffer-show-groups t
             centaur-tabs-set-modified-marker t
             ;;centaur-tabs-label-fixed-length 10
             centaur-tabs-set-icons t))
   #+end_src

   #+begin_src emacs-lisp
     (use-package eyebrowse
       :defer t
       :init
       (add-hook 'after-init-hook 'eyebrowse-mode)
       (setq eyebrowse-keymap-prefix "")
       :config
       (general-define-key
	"H-1" 'eyebrowse-switch-to-window-config-1
	"H-2" 'eyebrowse-switch-to-window-config-2
	"H-3" 'eyebrowse-switch-to-window-config-3
	"H-4" 'eyebrowse-switch-to-window-config-4
	"H-5" 'eyebrowse-switch-to-window-config-5
	"H-6" 'eyebrowse-switch-to-window-config-6
	"H-7" 'eyebrowse-switch-to-window-config-7
	"H-8" 'eyebrowse-switch-to-window-config-8
	"H-9" 'eyebrowse-switch-to-window-config-9
	"H-`" 'eyebrowse-rename-window-config
	"H-q" 'eyebrowse-close-window-config
	"s-t" 'eyebrowse-create-window-config))

     (use-package switch-window
       :init
       (setq switch-window-auto-resize-window t
	     switch-window-minibuffer-shortcut ?z)
       ;; switch-window-multiple-frames t)
       (general-define-key
	"s-d" 'switch-window-then-split-right
	"s-[" 'windmove-left
	"s-]" 'windmove-right
	"s-w" 'delete-window
	"H-t" 'switch-window))
   #+end_src
* 自动 revert
  #+begin_src emacs-lisp :tangle no
    (use-package autorevert
      :defer t
      :ensure nil
      :hook (after-init . global-auto-revert-mode))
  #+end_src
