init.el

(use-package evil-matchit
  :hook (prog-mode . evil-matchit-mode))

(use-package evil-surround
  :after evil
  :config (global-evil-surround-mode t)
  :general
  (general-define-key
   :states 'motion
   "s" 'evil-surround-region))

(use-package evil-embrace
  :after evil-surround
  :config
  (evil-embrace-enable-evil-surround-integration))

(use-package evil-visualstar
  :after evil
  :init
  (global-evil-visualstar-mode)
  :config
  (setq evil-visualstar/persistent t))
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package god-mode
  :config
  (setq god-mode-alist '((nil . "C-") ("m" . "M-") ("G" . "C-M-")))
  (evil-define-key 'god global-map "<escape>" 'evil-god-state-bail))

(defun private/god-start ()
  (interactive)
  (evil-execute-in-god-state)
  (god-mode-self-insert))

(use-package evil-god-state
  :general
  (common-leader
    "c" 'private/god-start
    "x" 'private/god-start
    "m" 'private/god-start
    "G" 'private/god-start))

(use-package spaceline
  :init
  (setq powerline-image-apple-rgb t
	spaceline-buffer-size-p nil
	spaceline-evil-state-p t
	spaceline-flycheck-error-p t
	spaceline-flycheck-warning-p t
	spaceline-flycheck-info-p t
	spaceline-minor-modes-p nil
	spaceline-anzu-p t
	spaceline-projectile-root-p nil
	spaceline-version-control-p nil
	spaceline-org-pomodoro-p nil
	powerline-default-separator 'box
	spaceline-separator-dir-left '(right . right)
	spaceline-separator-dir-right '(left . left)
	spaceline-highlight-face-func 'spaceline-highlight-face-evil-state
	spaceline-workspace-numbers-unicode t)
  (add-hook 'after-init-hook #'spaceline-emacs-theme))

(use-package evil-anzu
  :init
  (global-anzu-mode +1)
  (setq anzu-cons-mode-line-p nil))

(use-package doom-themes
  :init
  (setq doom-themes-enable-bold t
	doom-themes-enable-italic t)
  (defun load-doom-theme (frame)
    (select-frame frame)
    (load-theme 'doom-one t))
  (if (daemonp)
      (add-hook 'after-make-frame-functions 'load-doom-theme)
    (load-theme 'doom-one t)))

(scroll-bar-mode -1)
(tool-bar-mode -1)

(use-package nyan-mode
  :init
  (add-hook 'after-init-hook 'nyan-mode))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package hl-todo
  :hook (prog-mode . hl-todo-mode))

(use-package posframe
  :defer t)

(setq inhibit-startup-screen t)

(use-package eyebrowse
  :defer t
  :init
  (add-hook 'after-init-hook 'eyebrowse-mode)
  (setq eyebrowse-keymap-prefix "")
  :config
  (general-define-key
   "H-1" 'eyebrowse-switch-to-window-config-1
   "H-2" 'eyebrowse-switch-to-window-config-2
   "H-3" 'eyebrowse-switch-to-window-config-3
   "H-4" 'eyebrowse-switch-to-window-config-4
   "H-5" 'eyebrowse-switch-to-window-config-5
   "H-6" 'eyebrowse-switch-to-window-config-6
   "H-7" 'eyebrowse-switch-to-window-config-7
   "H-8" 'eyebrowse-switch-to-window-config-8
   "H-9" 'eyebrowse-switch-to-window-config-9
   "H-`" 'eyebrowse-rename-window-config
   "H-q" 'eyebrowse-close-window-config
   "s-t" 'eyebrowse-create-window-config))

(use-package switch-window
  :init
  (setq switch-window-auto-resize-window t
	switch-window-minibuffer-shortcut ?z)
  (general-define-key
   "s-d" 'switch-window-then-split-right
   "s-[" 'windmove-left
   "s-]" 'windmove-right
   "s-w" 'delete-window
   "H-t" 'switch-window))
