init_el.org
*** TODO skim with org-ref
设置更加具有交互性的 skim 行为。探索中。。。想法 [[https://emacs-china.org/t/org-ref-integration-with-skim-app-update/4614/14][源自于此]] ，但这里的代码并不能成功运行，而且他是利用 skim 笔记在页面中的索引做导航的，所以干脆改为根据 note id 做导航吧。
#+begin_src emacs-lisp :tangle no
  (defun private/get-skim-link ()
    "Generate the formatted skim link"
    (do-applescript
     (concat
      "tell application \"Skim\"\n"
      "  set theDoc to front document\n"
      "  set theTitle to (name of theDoc)\n"
      "  set thePath to (path of theDoc)\n"
      "  set thePage to (get index of current page of theDoc)\n"
      "  set theNote to (active note of theDoc)\n"
      "  set theSelection to selection of theDoc\n"
      "  set theContent to (contents of theSelection) as string\n"
      "  if theNote is not missing value then\n"
      "    set theContent to (contents of (get text of theNote))\n"
      "    set theNotePage to (get page of theNote)\n"
      "    set thePage to (get index of theNotePage)\n"
      "    set theNoteID to (get id of theNote)\n"
      "  else\n"
      "    if theContent is \"\" then\n"
      "        set theNoteID to \"0000\"\n"
      "    else\n"
      "        tell theDoc\n"
      "            set theNote to make new note with data theSelection with properties {type:underline note, color: red}\n"
      "            set active note of theDoc to theNote\n"
      "            set text of theNote to (contents of theSelection) as string\n"
      "            set theNotePage to (get page of theNote)\n"
      "            set thePage to (get index of theNotePage)\n"
      "            set theNoteID to (get id of theNote)\n"
      "        end tell\n"
      "    end if\n"
      "  end if\n"
      "  set theLink to \"skim://\" & thePath & \"::\" & thePage & \";;\" & theNoteID \n"
      "end tell\n"
      "return theLink as string\n")))

  (defun private/open-skim-link (uri)
    "Visit page of pdf in Skim"
    (let* ((note-id (when (string-match ";;\\(.+\\)\\'" uri) (match-string 1 uri)))
           (page (when (string-match "::\\(.+\\);;" uri) (match-string 1 uri)))
           (document (substring uri 0 (match-beginning 0))))
      (do-applescript
       (concat
        "tell application \"Skim\"\n"
        "activate\n"
        "set theDoc to open \"" document "\"\n"
        "set thePage to (first page of theDoc where its index =\"" page "\")\n"
        "try\n"
        "  set theNote to (first note of thePage where its id = \"" note-id "\")\n"
        "on error errMsg number errorNumber\n"
        "  set theNote to 0\n"
        "end try\n"
        "if theNote is 0 then\n"
        "    go document 1 to thePage\n"
        "else\n"
        "  set thePathList to (get path list of theNote)\n"
        "  set thePoint to (first item of (first list of thePathList))\n"
        "  go document 1 to thePage at thePoint\n"
        "  set active note to theNote\n"
        "end if\n"
        "end tell"))))

  (defun private/get-skim-bibtex-key ()
    (let* ((name (do-applescript
                  (concat
                   "tell application \"Skim\"\n"
                   "set theDoc to front document\n"
                   "set theTitle to (name of theDoc)\n"
                   "end tell\n"
                   "return theTitle as string\n")))
           (key (when (string-match "\\(.+\\).pdf" name) (match-string 1 name))))
      key))

  (org-link-set-parameters "skim" :follow #'my-org-mac-skim-open)

  (defadvice org-capture-finalize
      (after org-capture-finalize-after activate)
    "Advise capture-finalize to close the frame"
    (if (equal "SA" (org-capture-get :key))
        (do-applescript "tell application \"Skim\"\n    activate\nend tell")))

  (defun private/clean-skim-page-link (link)
    (let* ((link (replace-regexp-in-string "\n" " " link))
           (link (replace-regexp-in-string "- " " " link)))
      link))

  (defun private/get-skim-page ()
    (let* ((page (do-applescript
                  (concat
                   "tell application \"Skim\"\n"
                   "set theDoc to front document\n"
                   "set thePage to (get index of current page of theDoc)\n"
                   "end tell\n"
                   "return thePage as integer\n"))))
      page))
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (private/get-skim-page)


  (defun my-org-mac-skim-get-page ()
    (interactive)
    (message "Applescript: Getting Skim page link...")
    (org-mac-paste-applescript-links (my-as-clean-skim-page-link (my-as-get-skim-page-link))))

  (defun my-org-mac-skim-insert-page ()
    (interactive)
    (insert (my-org-mac-skim-get-page)))
  (defun my-org-move-point-to-capture ()
    (cond ((org-at-heading-p) (org-beginning-of-line))
          (t (org-previous-visible-heading 1))))
  (defun my-org-ref-find-entry-in-notes (key)
    "Find or create bib note for KEY"
    (let* ((entry (bibtex-completion-get-entry key)))
      (widen)
      (goto-char (point-min))
      (unless (derived-mode-p 'org-mode)
        (error
         "Target buffer \"%s\" for jww/find-journal-tree should be in Org mode"
         (current-buffer)))
      (let* ((headlines (org-element-map
                            (org-element-parse-buffer)
                            'headline 'identity))
             (keys (mapcar
                    (lambda (hl) (org-element-property :CUSTOM_ID hl))
                    headlines)))
        ;; put new entry in notes if we don't find it.
        (if (-contains? keys key)
            (progn
              (org-open-link-from-string (format "[[#%s]]" key))
              (lambda nil
                (cond ((org-at-heading-p)
                       (org-beginning-of-line))
                      (t (org-previous-visible-heading 1))))
              )
          ;; no entry found, so add one
          (goto-char (point-max))
          (insert (org-ref-reftex-format-citation
                   entry (concat "\n" org-ref-note-title-format)))
          (mapc (lambda (x)
                  (save-restriction
                    (save-excursion
                      (funcall x))))
                org-ref-create-notes-hook)
          (org-open-link-from-string (format "[[#%s]]" key))
          (lambda nil
            (cond ((org-at-heading-p)
                   (org-beginning-of-line))
                  (t (org-previous-visible-heading 1))))
          ))
      ))
  (defun private/move-point-to-capture-skim-annotation ()
    (let* ((keystring (my-as-get-skim-bibtex-key)))
      (my-org-ref-find-entry-in-notes keystring)))

  (add-hook 'org-capture-prepare-finalize-hook #'(lambda () (private/skim-org-link (org-id-get-create))))

  (defun private/skim-org-link (id)
    (do-applescript (concat
                     "tell application \"Skim\"\n"
                     "set runstatus to \"not set\"\n"
                     "set theDoc to front document\n"
                     "try\n"
                     "    set theNote to active note of theDoc\n"
                     "end try\n"
                     "if theNote is not missing value then\n"
                     "    set newText to text of theNote\n"
                     "    set startpoint to  (offset of \"org-id:{\" in newtext)\n"
                     "    set endpoint to  (offset of \"}:org-id\" in newtext)\n"
                     "    if (startpoint is equal to endpoint) and (endpoint is equal to 0) then\n"
                     "        set newText to text of theNote & \"\norg-id:{\" & "
                     (applescript-quote-string id)
                     " & \"}:org-id\"\n"
                     "        set text of theNote to newText\n"
                     "        return \"set success\"\n"
                     "    end if\n"
                     "end if\n"
                     "end tell\n"
                     "return \"unset\"\n"
                     )))

  (defun applescript-quote-string (argument)
    "Quote a string for passing as a string to AppleScript."
    (if (or (not argument) (string-equal argument ""))
        "\"\""
      ;; Quote using double quotes, but escape any existing quotes or
      ;; backslashes in the argument with backslashes.
      (let ((result "")
            (start 0)
            end)
        (save-match-data
          (if (or (null (string-match "[^\"\\]" argument))
                  (< (match-end 0) (length argument)))
              (while (string-match "[\"\\]" argument start)
                (setq end (match-beginning 0)
                      result (concat result (substring argument start end)
                                     "\\" (substring argument end (1+ end)))
                      start (1+ end))))
          (concat "\"" result (substring argument start) "\"")))))
#+end_src
*** DONE 设置翻页快捷键
    - State "DONE"       from "TODO"       [2021-11-14 Sun 21:55]
    检测当前是否有 nov buffer ，如果有，则执行 nov 翻页，否则执行 skim 翻页。
#+begin_src emacs-lisp
  (require 'skim)

  (defun nov-buffer-in-current ()
    (cl-find-if
     (lambda (window)
       (with-current-buffer (window-buffer window) (eq major-mode 'nov-mode)))
     (window-list)))

  (defun reader/scroll-up (arg)
    (interactive "P")
    (let ((nov-window (nov-buffer-in-current))
    (current-window (get-buffer-window)))
      (if nov-window
    (progn
      (select-window nov-window)
      (nov-scroll-up arg)
      (select-window current-window))
  (skim-next-page))))

  (defun reader/scroll-down (arg)
    (interactive "P")
    (let ((nov-window (nov-buffer-in-current))
    (current-window (get-buffer-window)))
      (if nov-window
    (progn
      (select-window nov-window)
      (nov-scroll-down arg)
      (select-window current-window))
  (skim-prev-page))))

  (defun reader/goto-pdf-first-page-or-nov-toc ()
    (interactive)
    (let ((nov-window (nov-buffer-in-current))
    (current-window (get-buffer-window)))
      (if nov-window
    (progn
      (select-window nov-window)
      (nov-goto-toc)
      (select-window current-window))
  (skim-goto 1))))

#+end_src
** Helpers
*** tab 循环展开图片
#+begin_src emacs-lisp
  ;;; Only display inline images under current subtree.
  (defun org-display-subtree-inline-images (&optional state)
    "Toggle the display of inline images under current subtree.
  INCLUDE-LINKED is passed to `org-display-inline-images'."
    (interactive)
    (save-excursion
      (save-restriction
	(org-narrow-to-subtree)
	(let* ((beg (point-min))
	       (end (point-max))
	       (image-overlays (cl-intersection
				org-inline-image-overlays
				(overlays-in beg end)))
	       (display-inline-images-local
		(lambda ()
		  (org-display-inline-images t t beg end)
		  (setq image-overlays (cl-intersection
					org-inline-image-overlays
					(overlays-in beg end)))
		  (if (and (org-called-interactively-p) image-overlays)
		      (message "%d images displayed inline"
			       (length image-overlays)))))
	       (hide-inline-images-local
		(lambda ()
		  (org-remove-inline-images)
		  (message "Inline image display turned off"))))
	  (if state
	      (pcase state
		('subtree
		 (funcall display-inline-images-local))
		('folded
		 (funcall hide-inline-images-local)))
	    (if image-overlays
		(funcall display-inline-images-local)
	      (funcall hide-inline-images-local)))))))
#+end_src

*** 循环展开 properties
#+begin_src emacs-lisp
  (defun org-hide-properties ()
    "Hide all org-mode headline property drawers in buffer. Could be slow if it has a lot of overlays."
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward
	      "^ *:properties:\n\\( *:.+?:.*\n\\)+ *:end:\n" nil t)
	(let ((ov_this (make-overlay (match-beginning 0) (match-end 0))))
	  (overlay-put ov_this 'display "")
	  (overlay-put ov_this 'hidden-prop-drawer t))))
    (put 'org-toggle-properties-hide-state 'state 'hidden))

  (defun org-show-properties ()
    "Show all org-mode property drawers hidden by org-hide-properties."
    (interactive)
    (remove-overlays (point-min) (point-max) 'hidden-prop-drawer t)
    (put 'org-toggle-properties-hide-state 'state 'shown))

  (defun org-toggle-properties ()
    "Toggle visibility of property drawers."
    (interactive)
    (if (eq (get 'org-toggle-properties-hide-state 'state) 'hidden)
	(org-show-properties)
      (org-hide-properties)))
#+end_src

