init.el

(defun nov-buffer-in-current ()
  (cl-find-if
   (lambda (window)
     (with-current-buffer (window-buffer window) (eq major-mode 'nov-mode)))
   (window-list)))

(defun reader/scroll-up (arg)
  (interactive "P")
  (let ((nov-window (nov-buffer-in-current))
	(current-window (get-buffer-window)))
    (if nov-window
	(progn
	  (select-window nov-window)
	  (nov-scroll-up arg)
	  (select-window current-window))
      (skim-next-page))))

(defun reader/scroll-down (arg)
  (interactive "P")
  (let ((nov-window (nov-buffer-in-current))
	(current-window (get-buffer-window)))
    (if nov-window
	(progn
	  (select-window nov-window)
	  (nov-scroll-down arg)
	  (select-window current-window))
      (skim-prev-page))))

(defun reader/goto-pdf-first-page-or-nov-toc ()
  (interactive)
  (let ((nov-window (nov-buffer-in-current))
	(current-window (get-buffer-window)))
    (if nov-window
	(progn
	  (select-window nov-window)
	  (nov-goto-toc)
	  (select-window current-window))
      (skim-goto 1))))

;;; Only display inline images under current subtree.
(defun org-display-subtree-inline-images (&optional state)
  "Toggle the display of inline images under current subtree.
INCLUDE-LINKED is passed to `org-display-inline-images'."
  (interactive)
  (save-excursion
    (save-restriction
      (org-narrow-to-subtree)
      (let* ((beg (point-min))
	     (end (point-max))
	     (image-overlays (cl-intersection
			      org-inline-image-overlays
			      (overlays-in beg end)))
	     (display-inline-images-local
	      (lambda ()
		(org-display-inline-images t t beg end)
		(setq image-overlays (cl-intersection
				      org-inline-image-overlays
				      (overlays-in beg end)))
		(if (and (org-called-interactively-p) image-overlays)
		    (message "%d images displayed inline"
			     (length image-overlays)))))
	     (hide-inline-images-local
	      (lambda ()
		(org-remove-inline-images)
		(message "Inline image display turned off"))))
	(if state
	    (pcase state
	      ('subtree
	       (funcall display-inline-images-local))
	      ('folded
	       (funcall hide-inline-images-local)))
	  (if image-overlays
	      (funcall display-inline-images-local)
	    (funcall hide-inline-images-local)))))))

(defun org-hide-properties ()
  "Hide all org-mode headline property drawers in buffer. Could be slow if it has a lot of overlays."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward
	    "^ *:properties:\n\\( *:.+?:.*\n\\)+ *:end:\n" nil t)
      (let ((ov_this (make-overlay (match-beginning 0) (match-end 0))))
	(overlay-put ov_this 'display "")
	(overlay-put ov_this 'hidden-prop-drawer t))))
  (put 'org-toggle-properties-hide-state 'state 'hidden))

(defun org-show-properties ()
  "Show all org-mode property drawers hidden by org-hide-properties."
  (interactive)
  (remove-overlays (point-min) (point-max) 'hidden-prop-drawer t)
  (put 'org-toggle-properties-hide-state 'state 'shown))

(defun org-toggle-properties ()
  "Toggle visibility of property drawers."
  (interactive)
  (if (eq (get 'org-toggle-properties-hide-state 'state) 'hidden)
      (org-show-properties)
    (org-hide-properties)))
