init_el.org
*** mac 通知
依赖于终端软件 =terminal-notifier= 。
#+begin_src emacs-lisp
  (defun notify-osx (title message)
  (call-process "terminal-notifier"
                nil 0 nil
                "-group" "Emacs"
                "-title" title
                "-sender" "org.gnu.Emacs"
                "-mesage" message
                "-activate" "org.gnu.Emacs"))
#+end_src
** Org-babel
*** elixir
    #+begin_src emacs-lisp
      (use-package ob-elixir :after org)
      (use-package ox-gfm :after org)
      (use-package ob-applescript :after org)
      (use-package ob-racket
        :quelpa (ob-racket :fetcher github :repo "hasu/emacs-ob-racket" :branch "master")
        :init
        (setq ob-racket-default-lang "sicp")
        :after org)
    #+end_src

** 本体

#+begin_src emacs-lisp
  (use-package org
    :pin gnu
    :ensure nil
    :ensure-system-package terminal-notifier
    :defer t
    :init
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (applescript . t)
       (elixir . t)
       (org . t)
       (haskell . t)
       (lisp . t)
       (plantuml . t)
       (racket . t)))
    ;;(R . t)))
    :config
      ;;; auto display inline images on Org TAB cycle expand headlines.
    ;; (add-hook 'org-mode-hook 'scimax-src-keymap-mode)
    (add-hook 'org-cycle-hook #'org-display-subtree-inline-images)
    (add-to-list 'org-export-backends 'md)
    (setq org-todo-keywords '((sequence "TODO(t/!)" "WAIT(w/!)" "|" "DONE(d/!)" "DELEGATED(g@)" "CANCELED(c@)"))
          ;; org-default-notes-file org-agenda-file
          org-archive-location (concat org-directory "Archived/" "%s_archive::")
          org-id-locations-file (concat org-directory ".org-id-locations")
          org-plantuml-jar-path (concat private/config-directory "plantuml-1.2021.16.jar")
          org-log-done nil
          ;; (nconc org-modules '(org-id))
          ;; org-refile-targets '((org-agenda-files :maxlevel . 2))
          org-refile-use-outline-path 'file
          org-outline-path-complete-in-steps nil
          org-refile-allow-creating-parent-nodes 'confirm
          org-refile-use-cache t
          org-startup-truncated nil
          org-confirm-babel-evaluate nil
          org-M-RET-may-split-line '((headline . nil) (item . nil) (default . t))
          org-html-validation-link nil)
    ;; refresh cache when emacs idle 5 mins
    (run-with-idle-timer 300 t (lambda ()
                                 (org-refile-cache-clear)
                                 ;; (org-refile-get-targets)
                                 (org-roam-db-sync))))
#+end_src

** 美观
   有时候反而觉得原始状态挺好看。。。而且这个插件极度影响性能。。。所以先禁止掉。
#+begin_src emacs-lisp :tangle no
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode))
#+end_src
** TODO Org-ref
     查阅相关资料后，对于我这种没有知识整理，文档输出的人废物来说，无用。。。
     又发现想作到笔记的精确对应（按之前方案只能对应到页），几个成熟方案还是需要他。。。
     这里有个问题，是默认从 calibredb 生成的 bibtex 文件的 key 包含有中括号，会影响 org-ref 的解析，所以需要注意更改导出的 key 格式。

#+begin_src emacs-lisp
  (setq publication-bib (concat base-directory "publication_catelog.bib")
        videos-bib (concat base-directory "videos.bib")
        collections-bib (concat base-directory "collections.bib"))

  (defun goto-videos-bib ()
    (interactive)
    (find-file videos-bib))

  (use-package ivy-bibtex
    :defer t
    :init
    (setq bibtex-completion-bibliography `(,publication-bib ,videos-bib)
          bibtex-completion-pdf-field "file"
          bibtex-completion-notes-path org-directory
          ivy-bibtex-default-action 'bibtex-completion-edit-notes
          bibtex-completion-library-path (concat base-directory "collections/")
          bibtex-completion-display-formats '((article . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*} ${journal:40}")
                                              (inbook . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*} Chapter ${chapter:32}")
                                              (incollection . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*} ${booktitle:40}")
                                              (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*} ${booktitle:40}")
                                              (t . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*}"))
          bibtex-completion-pdf-extension '(".pdf" ".djvu")))

  (use-package org-ref
    :after org
    :init
    (setq reftex-default-bibliography `(,publication-bib ,collections-bib ,videos-bib)
          ;;org-ref-bibliography-notes (concat org-directory "ref-notes.org")
          org-ref-default-bibliography `(,publication-bib ,collections-bib ,videos-bib)
          ;;org-ref-pdf-directory private/book-directory
          calibredb-ref-default-bibliography publication-bib
          org-ref-get-pdf-filename-function 'org-ref-get-mendeley-filename)
    (require 'bibtex)

    (setq bibtex-autokey-year-length 4
          bibtex-autokey-name-year-separator "-"
          bibtex-autokey-year-title-separator "-"
          bibtex-autokey-titleword-separator "-"
          bibtex-autokey-titlewords 2
          bibtex-autokey-titlewords-stretch 1
          bibtex-autokey-titleword-length 5
          org-ref-bibtex-hydra-key-binding (kbd "H-b"))

    (require 'org-ref-ivy)

    (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
          org-ref-insert-cite-function 'org-ref-cite-insert-ivy
          org-ref-insert-label-function 'org-ref-insert-label-link
          org-ref-insert-ref-function 'org-ref-insert-ref-link
          org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body))))
  ;; org-ref-completion-library 'org-ref-ivy-cite-completion))
#+end_src
** Agenda
#+begin_src emacs-lisp
  (defun org-refresh-agenda-files ()
    (interactive)
    (setq org-agenda-files (directory-files (concat org-directory "worklog/") t ".org")))
#+end_src
** Bookmark
   使用 org 文件做了一个收藏夹。
#+begin_src emacs-lisp
  (setq private/bookmark-file (concat org-directory "bookmarks.org"))
  (defun open-bookmarks ()
    (interactive)
    (if (buffer-live-p "bookmarks.org")
	(pop-to-buffer "bookmarks.org")
      (find-file private/bookmark-file)))
#+end_src
** Org-roam
#+begin_src emacs-lisp
  (use-package emacsql-sqlite-builtin)
  (use-package org-roam
    :init
    (add-hook 'after-init-hook 'org-roam-setup)
    (setq org-roam-v2-ack t
          org-roam-directory org-directory
          org-roam-db-gc-threshold most-positive-fixnum
          org-roam-db-location (concat org-directory "org-roam.db")
          org-roam-dailies-directory "worklog/"
          org-roam-database-connector 'sqlite-builtin)

    (require 'org-roam-protocol)
    :config
    (setq org-roam-node-display-template "${hierarchy:*}
  ${tags:20}")
    (setq org-roam-completion-everywhere t
          org-roam-completion-system 'ivy
          org-roam-capture-templates
          '(("r" "bibliography reference" plain "%?"
             :target
             (file+head "references/${citekey}.org" "#+title: ${title\n}")
             :unnarrowed t)))
    (setq org-roam-capture-ref-templates
          '(("b" "Bookmark" plain "%?\n*** ${title}\n:PROPERTIES:\n:ID: %(org-id-new)\n:ROAM_REFS: ${ref}\n:ROAM_EXCLUDE: t\n:END:" :if-new (file+olp "%(symbol-value 'bookmark-file)" ("Uncategorized")) :immediate-finish t :unnarrowed t :empty-lines-after 1))) ;;
    (setq org-roam-dailies-capture-templates
          '(("d" "dailies" entry "* %<%R> %?" :target (file+head "%<%Y%m%d-%W>.org" "#+title: %<%Y-%m-%d>\n"))))
    ;; must after use-package org-roam
    (cl-defmethod org-roam-node-filetitle ((node org-roam-node))
      "Return the file TITLE for the node."
      (org-roam-get-keyword "TITLE" (org-roam-node-file node)))
    (cl-defmethod org-roam-node-hierarchy ((node org-roam-node))
      "Return the hierarchy for the node."
      (let ((title (org-roam-node-title node))
            (olp (org-roam-node-olp node))
            (level (org-roam-node-level node))
            (filetitle (org-roam-node-filetitle node)))
        (concat
         (if (> level 0) (concat filetitle " > "))
         (if (> level 1) (concat (string-join olp " > ") " > "))
         title))))

  (use-package org-roam-bibtex
    :hook (org-mode . org-roam-bibtex-mode)
    :after org-roam
    :init
    (setq orb-roam-ref-format 'org-ref-v3))
#+end_src

** Org-clock
#+begin_src emacs-lisp
    (setq org-clock-clocked-in-display nil
	  org-clock-mode-line-total 'current)
#+end_src

** Org-pomodoro
   番茄钟。但暂不使用。
#+begin_src emacs-lisp :tangle no
  (use-package org-pomodoro
    :commands org-pomodoro
    :config
    (add-hook 'org-pomodoro-finished-hook
	      (lambda()
		(notify-osx "Pomodoro completed!" "Time for a break.")))
    (add-hook 'org-pomodoro-break-finished-hook
	      (lambda()
		(notify-osx "Pomodoro Short Break Finished!" "Ready for Another?")))
    (add-hook 'org-pomodoro-long-break-finished-hook
	      (lambda()
		(notify-osx "Pomodoro Long Break Finished!" "Ready for Another?")))
    (add-hook 'org-pomodoro-killed-hook
	      (lambda()
		(notify-osx "Pomodoro Killed!" "One does not simply kill a pomodoro!"))))
#+end_src
