init.el

(defun notify-osx (title message)
(call-process "terminal-notifier"
              nil 0 nil
              "-group" "Emacs"
              "-title" title
              "-sender" "org.gnu.Emacs"
              "-mesage" message
              "-activate" "org.gnu.Emacs"))

(use-package ob-elixir :after org)

(use-package org
  :pin gnu
  :ensure nil
  :ensure-system-package terminal-notifier
  :defer t
  :init
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (elixir . t)
     (org . t)
     (haskell . t)
     (lisp . t)
     (plantuml . t)))
  ;;(R . t)))
  :config
  ;; 使 org-mode 中的 company 可以补全代码 symbol
  ;;(push 'org-mode company-dabbrev-code-modes)
  ;;; auto display inline images on Org TAB cycle expand headlines.
  ;; (add-hook 'org-mode-hook 'scimax-src-keymap-mode)
  (add-hook 'org-cycle-hook #'org-display-subtree-inline-images)
  (add-to-list 'org-export-backends 'md)
  (setq org-todo-keywords '((sequence "TODO(t/!)" "WAIT(w/!)" "|" "DONE(d/!)" "DELEGATED(g@)" "CANCELED(c@)"))
	;; org-default-notes-file org-agenda-file
	org-archive-location (concat org-directory "Archived/" "%s_archive::")
	org-id-locations-file (concat org-directory ".org-id-locations")
	org-plantuml-jar-path (concat private/config-directory "plantuml-1.2021.16.jar")
	org-log-done nil
	;; (nconc org-modules '(org-id))
	;; org-refile-targets '((org-agenda-files :maxlevel . 2))
	org-refile-use-outline-path 'file
	org-outline-path-complete-in-steps nil
	org-refile-allow-creating-parent-nodes 'confirm
	org-refile-use-cache t
	org-startup-truncated nil
	org-confirm-babel-evaluate nil
	org-M-RET-may-split-line '((headline . nil) (item . nil) (default . t))
	org-html-validation-link nil)
  ;; refresh cache when emacs idle 5 mins
  (run-with-idle-timer 300 t (lambda ()
			       (org-refile-cache-clear)
			       ;; (org-refile-get-targets)
			       (org-roam-db-sync))))

(setq publication-bib (concat base-directory "publication_catelog.bib")
      collections-bib (concat base-directory "collections.bib"))

(use-package ivy-bibtex
  :defer t
  :init
  (setq bibtex-completion-bibliography `(,publication-bib)
	bibtex-completion-pdf-field "file"
	bibtex-completion-notes-path org-directory
	bibtex-completion-library-path (concat base-directory "collections/")
	bibtex-completion-display-formats '((article . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*} ${journal:40}")
					    (inbook . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*} Chapter ${chapter:32}")
					    (incollection . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*} ${booktitle:40}")
					    (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*} ${booktitle:40}")
					    (t . "${=has-pdf=:1}${=has-note=:1} ${=type=:4} ${title:*}"))
	bibtex-completion-pdf-extension '(".pdf" ".djvu")))
(use-package org-ref
  :after org
  :init
  (setq reftex-default-bibliography `(,publication-bib ,collections-bib)
	;;org-ref-bibliography-notes (concat org-directory "ref-notes.org")
	org-ref-default-bibliography `(,publication-bib ,collections-bib)
	;;org-ref-pdf-directory private/book-directory
	calibredb-ref-default-bibliography publication-bib
	org-ref-get-pdf-filename-function 'org-ref-get-mendeley-filename)
  (require 'bibtex)

  (setq bibtex-autokey-year-length 4
	bibtex-autokey-name-year-separator "-"
	bibtex-autokey-year-title-separator "-"
	bibtex-autokey-titleword-separator "-"
	bibtex-autokey-titlewords 2
	bibtex-autokey-titlewords-stretch 1
	bibtex-autokey-titleword-length 5
	org-ref-bibtex-hydra-key-binding (kbd "H-b"))

  (require 'org-ref-ivy)

  (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
	org-ref-insert-cite-function 'org-ref-cite-insert-ivy
	org-ref-insert-label-function 'org-ref-insert-label-link
	org-ref-insert-ref-function 'org-ref-insert-ref-link
	org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body))))
;; org-ref-completion-library 'org-ref-ivy-cite-completion))

(defun org-refresh-agenda-files ()
  (interactive)
  (setq org-agenda-files (directory-files (concat org-directory "journal/") t ".org")))

(setq private/bookmark-file (concat org-directory "bookmarks.org"))
(defun open-bookmarks ()
  (interactive)
  (if (buffer-live-p "bookmarks.org")
      (pop-to-buffer "bookmarks.org")
    (find-file private/bookmark-file)))

(use-package org-roam
  :init
  (add-hook 'after-init-hook 'org-roam-setup)
  (setq org-roam-v2-ack t
	org-roam-directory org-directory
	org-roam-db-gc-threshold most-positive-fixnum
	org-roam-db-location (concat org-directory "org-roam.db")
	org-roam-dailies-directory "journal/")

  (require 'org-roam-protocol)
  :config
  (setq org-roam-node-display-template "${hierarchy:*}
${tags:20}")
  (setq org-roam-completion-everywhere t)
  (setq org-roam-completion-system 'ivy)
  (setq org-roam-capture-ref-templates
	'(("b" "Bookmark" plain "%?\n*** ${title}\n:PROPERTIES:\n:ID: %(org-id-new)\n:ROAM_REFS: ${ref}\n:ROAM_EXCLUDE: t\n:END:" :if-new (file+olp "%(symbol-value 'bookmark-file)" ("Uncategorized")) :immediate-finish t :unnarrowed t :empty-lines-after 1))) ;;
  (setq org-roam-dailies-capture-templates
	'(("d" "dailies" entry "* %<%R> %?" :target (file+head "%<%Y%m%d-%W>.org" "#+title: %<%Y-%m-%d>\n"))))
  ;; must after use-package org-roam
  (cl-defmethod org-roam-node-filetitle ((node org-roam-node))
    "Return the file TITLE for the node."
    (org-roam-get-keyword "TITLE" (org-roam-node-file node)))
  (cl-defmethod org-roam-node-hierarchy ((node org-roam-node))
    "Return the hierarchy for the node."
    (let ((title (org-roam-node-title node))
	  (olp (org-roam-node-olp node))
	  (level (org-roam-node-level node))
	  (filetitle (org-roam-node-filetitle node)))
      (concat
       (if (> level 0) (concat filetitle " > "))
       (if (> level 1) (concat (string-join olp " > ") " > "))
       title))
    ))

(use-package org-roam-bibtex
  :after org-roam)

(setq org-clock-clocked-in-display nil
      org-clock-mode-line-total 'current)
