init_el.org
** Org-download
#+begin_src emacs-lisp
  (use-package org-download
    :after org
    :config
    (setq org-download-method 'directory
	  org-image-actual-width nil
	  org-download-screenshot-method "screencapture -i %s"
	  org-download-display-inline-images 'posframe
	  ;; disable DOWNLOAD link
	  org-download-annotate-function (lambda (_link) "")
	  org-download-image-attr-list '("#+ATTR_HTML: :width 70% :align center"))
    (setq-default org-download-image-dir (concat org-directory "images/")))
#+end_src
** Toc-org
#+begin_src emacs-lisp
  (use-package toc-org
    :init
    (add-hook 'org-mode-hook 'toc-org-mode))
#+end_src
** ox-hugo
#+begin_src emacs-lisp
  (use-package ox-hugo
    :after ox)
#+end_src
** org-pandoc-import
#+begin_src emacs-lisp
  (use-package org-pandoc-import
    :quelpa (org-pandoc-import :fetcher github :repo "tecosaur/org-pandoc-import" :branch "master" :files ("*.el" "filters" "preprocessors")))
#+end_src
** Org-media-note
使用了自己本地的修改，修改的内容是可以获取继承的 property ，可以播放父级下的视频。
#+begin_src emacs-lisp
  (use-package org-media-note
    :hook (org-mode .  org-media-note-mode)
    ;; :quelpa (org-media-note :fetcher github :repo "yuchen-lea/org-media-note" :branch "master")
    :quelpa (org-media-note :fetcher file :path "~/Kenton/org-media-note")
    :init
    (setq org-media-note-use-org-ref t
          org-media-note-ref-key-field "Video_ID")
    :config
    (setq org-media-note-screenshot-image-dir (concat org-directory "images/org-media/")
          org-media-note-use-refcite-first t))
#+end_src

** 翻译
注意， =sdcv-dictionary-data-dir= 必须使用绝对地址。
#+begin_src emacs-lisp
  (use-package sdcv
    :quelpa (sdcv :fetcher github :repo "manateelazycat/sdcv" :branch "master")
    :init
    (setq sdcv-dictionary-data-dir (file-truename (concat  private/config-directory "dictionary/"))
          sdcv-program "/opt/homebrew/bin/sdcv")
    :config
    (setq sdcv-dictionary-simple-list '("21世纪英汉汉英双向词典")
          sdcv-dictionary-complete-list '("21世纪英汉汉英双向词典"))
    (defun private/say-word-at-point ()
      (interactive)
      (sdcv-say-word (sdcv-region-or-word)))
    :general
    (general-define-key
     "s-E" 'sdcv-search-pointer+)
    (common-leader
      "k" '(:igonre :whick-key "sdcv")
      "ks" 'private/say-word-at-point
      "kk" 'sdcv-search-pointer+
      "kf" 'sdcv-search-pointer))
#+end_src

#+RESULTS:

** KeyBindings
   整体规划 org-mode 的按键。涉及到默认按键更改、全局按键、org-mode 按键。
#+begin_src emacs-lisp
    (general-define-key
     :keymaps 'org-mode-map
     "C-c C-r" nil
     "C-c r" 'org-reveal
     "C-s-4" 'org-download-screenshot
     "H-v" 'org-media-note-hydra/body
     "C-c ]" 'org-ref-insert-link)

    (general-define-key
     :prefix "C-c C-r"
     "C-d" '(:ignore t :which-key "org-dailies")
     "C-d C-t" 'org-roam-dailies-goto-today
     "C-d C-d" 'org-roam-dailies-goto-date
     "C-d C-p" 'org-roam-dailies-goto-previous-note
     "C-d C-n" 'org-roam-dailies-goto-next-note
     "C-f" 'org-roam-node-find)

    (common-leader
     "d" '(:ignore t :which-key "org-dailies")
     "t" 'org-roam-dailies-goto-today
     "d" 'org-roam-dailies-goto-date
     "p" 'org-roam-dailies-goto-previous-note
     "n" 'org-roam-dailies-goto-next-note)

    (common-leader
     "r" '(:ignore t :which-key "org-roam")
     "rf" 'org-roam-node-find
     "rr" 'org-roam-buffer-toggle)

    (local-leader
     :keymaps 'org-mode-map
     "i" '(:ignore t :which-key "insert")
     "ii" 'org-roam-node-insert
     "ia" 'org-roam-alias-add
     "ir" 'org-roam-ref-add
     "it" 'org-roam-tag-add
     "l" '(:ignore t :which-key "link")
     ;; "lr" 'org-mac-skim-insert-page ;; skim
     ;; "ls"  'org-mac-safari-insert-frontmost-url ;; internet
     ;; "lf"  'org-mac-finder-insert-selected ;; finder
     "ll" 'org-store-link
     "li" 'org-insert-last-stored-link)

    (general-define-key
     :keymaps 'org-mode-map
     "M-o" 'reader/goto-pdf-first-page-or-nov-toc
     "M-n" 'reader/scroll-up
     "M-p" 'reader/scroll-down)

    (general-define-key
     :keymaps 'nov-mode-map
     "M-n" 'nov-scroll-up
     "M-p" 'nov-scroll-down)

    (general-define-key
     :keymaps 'org-mode-map
     :prefix "C-c C-r"
     "r" 'org-roam-buffer-toggle
     "C-i" 'org-roam-node-insert
     "g" 'org-roam-graph
     "i" '(:ignore t :which-key "add property")
     "i a" 'org-roam-alias-add
     "i r" 'org-roam-ref-add
     "i t" 'org-roam-tag-add
     "d" '(:ignore t :which-key "remove property")
     "d a" 'org-roam-alias-remove
     "d r" 'org-roam-ref-remove
     "d t" 'org-roam-tag-remove)
    (general-define-key
     :keymaps 'bibtex-mode-map
     "H-b" 'org-ref-bibtex-hydra/body)

    (general-define-key
     :keymaps 'org-roam-mode-map
     [mouse-1] 'org-roam-visit-thing)
#+end_src
* Ivy
  =ivy-rich= 经过几天试用，发现并不太方便，暂时关闭。
  注意，需要在安装完成后，手动调用 =all-the-icons-install= 。
  #+begin_src emacs-lisp :tangle no
    (use-package ivy-rich
      :hook (all-the-icons-ivy-rich-mode . ivy-rich-mode)
      :init
      (setq ivy-virtual-abbreviate 'full
	    ivy-rich-switch-buffer-align-virtual-buffer t)
      (add-hook 'ivy-rich-mode-hook (lambda ()
				      ;; 因为文件在 project 中的路径较深，所以简化 counsel-projectile-find-file 的排版，仅显示图标、文件路径及文件大小
				      (ivy-rich-set-columns
				       'counsel-projectile-find-file
				       '((all-the-icons-ivy-rich-file-icon)
					 (counsel-projectile-find-file-transformer (:width 0.5))
					 (all-the-icons-ivy-rich-project-file-size (:width 0.1 :face all-the-icons-ivy-rich-size-face))))
				      ))
      :config
      (setcdr (assq t ivy-format-functions-alist) 'ivy-format-function-line))
    (use-package all-the-icons-ivy-rich
      :after counsel-projectile
      :init
      (add-hook 'after-init-hook 'all-the-icons-ivy-rich-mode))

  #+end_src

  #+begin_src emacs-lisp
    (use-package ivy
      :defer t
      :init
      (add-hook 'after-init-hook 'ivy-mode)
      (setq ivy-use-virtual-buffers t
	    enable-recursive-minibuffers t)
      :general
      (general-define-key
       :keymaps 'ivy-minibuffer-map
       [escape] 'minibuffer-keyboard-quit
       "C-<return>" 'ivy-immediate-done)
;;      (clear-spc
;;	:keymaps 'ivy-occur-grep-mode-map)
      (common-leader
	"/" 'counsel-rg))

    (use-package swiper
      :defer t
      :commands (swiper)
      :init
      (general-define-key
       "C-s" 'counsel-grep-or-swiper))

    (use-package counsel
      :hook (ivy-mode . counsel-mode)
      :config
      (common-leader
	"ff" 'counsel-find-file
	"fb" 'counsel-switch-buffer
	"fr" 'counsel-buffer-or-recentf))

    (use-package all-the-icons-ivy
      :init (add-hook 'after-init-hook 'all-the-icons-ivy-setup))

    (use-package wgrep
      :after ivy
      :config
      (setq wgrep-auto-save-buffer t))
  #+end_src
* Restart Emacs
  由于暂时采用 server client 启动方式，故不再需要 restart emacs 。
    #+begin_src emacs-lisp :tangle no
      (use-package restart-emacs
        :defer t
        :commands (restart-emacs))
  #+end_src
