init.el

(use-package org-download
  :after org
  :config
  (setq org-download-method 'directory
	org-image-actual-width nil
	org-download-screenshot-method "screencapture -i %s"
	org-download-display-inline-images 'posframe
	;; disable DOWNLOAD link
	org-download-annotate-function (lambda (_link) "")
	org-download-image-attr-list '("#+ATTR_HTML: :width 70% :align center"))
  (setq-default org-download-image-dir (concat org-directory "images/")))

(use-package toc-org
  :init
  (add-hook 'org-mode-hook 'toc-org-mode))

(use-package ox-hugo
  :after ox)

(use-package org-media-note
  :hook (org-mode .  org-media-note-mode)
  :quelpa (org-media-note :fetcher github :repo "yuchen-lea/org-media-note" :branch "master")
  :config
  (require 'org-attach)
  (setq org-media-note-screenshot-image-dir (concat org-directory "images/org-media/")))

(general-define-key
 :keymaps 'org-mode-map
 "C-c C-r" nil
 "C-c r" 'org-reveal
 "C-s-4" 'org-download-screenshot
 "H-v" 'org-media-note-hydra/body
 "C-c ]" 'org-ref-insert-link)

(general-define-key
 :prefix "C-c C-r"
 "C-d" '(:ignore t :which-key "org-dailies")
 "C-d C-t" 'org-roam-dailies-goto-today
 "C-d C-d" 'org-roam-dailies-goto-date
 "C-d C-p" 'org-roam-dailies-goto-previous-note
 "C-d C-n" 'org-roam-dailies-goto-next-note
 "C-f" 'org-roam-node-find)

(common-leader
 "d" '(:ignore t :which-key "org-dailies")
 "t" 'org-roam-dailies-goto-today
 "d" 'org-roam-dailies-goto-date
 "p" 'org-roam-dailies-goto-previous-note
 "n" 'org-roam-dailies-goto-next-note)

(common-leader
 "r" '(:ignore t :which-key "org-roam")
 "rf" 'org-roam-node-find
 "rr" 'org-roam-buffer-toggle)

(local-leader
 :keymaps 'org-mode-map
 "i" '(:ignore t :which-key "insert")
 "ii" 'org-roam-node-insert
 "ia" 'org-roam-alias-add
 "ir" 'org-roam-ref-add
 "it" 'org-roam-tag-add
 "l" '(:ignore t :which-key "link")
 "lr" 'org-mac-skim-insert-page ;; skim
 "ls"  'org-mac-safari-insert-frontmost-url ;; internet
 "lf"  'org-mac-finder-insert-selected ;; finder
 "ll" 'org-store-link
 "li" 'org-insert-last-stored-link)

(general-define-key
 :keymaps 'org-mode-map
 "M-o" 'reader/goto-pdf-first-page-or-nov-toc
 "M-n" 'reader/scroll-up
 "M-p" 'reader/scroll-down)

(general-define-key
 :keymaps 'nov-mode-map
 "M-n" 'nov-scroll-up
 "M-p" 'nov-scroll-down)

(general-define-key
 :keymaps 'org-mode-map
 :prefix "C-c C-r"
 "r" 'org-roam-buffer-toggle
 "C-i" 'org-roam-node-insert
 "g" 'org-roam-graph
 "i" '(:ignore t :which-key "add property")
 "i a" 'org-roam-alias-add
 "i r" 'org-roam-ref-add
 "i t" 'org-roam-tag-add
 "d" '(:ignore t :which-key "remove property")
 "d a" 'org-roam-alias-remove
 "d r" 'org-roam-ref-remove
 "d t" 'org-roam-tag-remove)
(general-define-key
 :keymaps 'bibtex-mode-map
 "H-b" 'org-ref-bibtex-hydra/body)

(general-define-key
 :keymaps 'org-roam-mode-map
 [mouse-1] 'org-roam-visit-thing)

(use-package ivy
      :defer t
      :init
      (add-hook 'after-init-hook 'ivy-mode)
      (setq ivy-use-virtual-buffers t
	    enable-recursive-minibuffers t)
      :general
      (general-define-key
       :keymaps 'ivy-minibuffer-map
       [escape] 'minibuffer-keyboard-quit
       "C-<return>" 'ivy-immediate-done)
;;      (clear-spc
;;	:keymaps 'ivy-occur-grep-mode-map)
      (common-leader
	"/" 'counsel-rg))

    (use-package swiper
      :defer t
      :commands (swiper)
      :init
      (general-define-key
       "C-s" 'counsel-grep-or-swiper))

    (use-package counsel
      :hook (ivy-mode . counsel-mode)
      :config
      (common-leader
	"ff" 'counsel-find-file
	"fb" 'counsel-switch-buffer
	"fr" 'counsel-buffer-or-recentf))

    (use-package all-the-icons-ivy
      :init (add-hook 'after-init-hook 'all-the-icons-ivy-setup))

    (use-package wgrep
      :after ivy
      :config
      (setq wgrep-auto-save-buffer t))
