init_el.org
* calibredb
#+begin_src emacs-lisp
  (use-package calibredb
    :defer t
    :quelpa (calibredb :fetcher github :repo "chenyanming/calibredb.el" :branch "develop")
    :commands (calibredb)
    :config
    (setq calibredb-size-show t
          ;;calibredb-format-all-the-icons t
          calibredb-id-width 4
          calibredb-title-width 40
          calibredb-date-width 0
          calibredb-root-dir private/book-directory
          calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir)
          calibredb-library-alist '(private/book-directory))
    :general
    (local-leader
      :keymaps 'calibredb-show-mode-map
      "?" 'calibredb-entry-dispatch
      "o" 'calibredb-find-file
      "O" 'calibredb-find-file-other-frame
      "V" 'calibredb-open-file-with-default-tool
      "s" 'calibredb-set-metadata-dispatch
      "e" 'calibredb-export-dispatch
      "q" 'calibredb-entry-quit
      "y" 'calibredb-yank-dispatch
      "," 'calibredb-quick-look
      "." 'calibredb-open-dired
      "\M-/" 'calibredb-rga
      "\M-t" 'calibredb-set-metadata--tags
      "\M-a" 'calibredb-set-metadata--author_sort
      "\M-A" 'calibredb-set-metadata--authors
      "\M-T" 'calibredb-set-metadata--title
      "\M-c" 'calibredb-set-metadata--comments)
    (local-leader
      :keymaps 'calibredb-search-mode-map
      "<RET>" 'calibredb-find-file
      "?" 'calibredb-dispatch
      "a" 'calibredb-add
      "A" 'calibredb-add-dir
      "c" 'calibredb-clone
      "d" 'calibredb-remove
      "D" 'calibredb-remove-marked-items
      "j" 'calibredb-next-entry
      "k" 'calibredb-previous-entry
      "l" 'calibredb-virtual-library-list
      "L" 'calibredb-library-list
      "n" 'calibredb-virtual-library-next
      "N" 'calibredb-library-next
      "p" 'calibredb-virtual-library-previous
      "P" 'calibredb-library-previous
      "s" 'calibredb-set-metadata-dispatch
      "S" 'calibredb-switch-library
      "o" 'calibredb-find-file
      "O" 'calibredb-find-file-other-frame
      "v" 'calibredb-view
      "V" 'calibredb-open-file-with-default-tool
      "," 'calibredb-quick-look
      "." 'calibredb-open-dired
      "y" 'calibredb-yank-dispatch
      "b" 'calibredb-catalog-bib-dispatch
      "e" 'calibredb-export-dispatch
      "r" 'calibredb-search-refresh-and-clear-filter
      "R" 'calibredb-search-clear-filter
      "q" 'calibredb-search-quit
      "m" 'calibredb-mark-and-forward
      "f" 'calibredb-toggle-favorite-at-point
      "x" 'calibredb-toggle-archive-at-point
      "h" 'calibredb-toggle-highlight-at-point
      "u" 'calibredb-unmark-and-forward
      "i" 'calibredb-edit-annotation
      "<DEL>" 'calibredb-unmark-and-backward
      "<backtab>" 'calibredb-toggle-view
      "TAB" 'calibredb-toggle-view-at-point
      "\M-n" 'calibredb-show-next-entry
      "\M-p" 'calibredb-show-previous-entry
      "/" 'calibredb-search-live-filter
      "\M-t" 'calibredb-set-metadata--tags
      "\M-a" 'calibredb-set-metadata--author_sort
      "\M-A" 'calibredb-set-metadata--authors
      "\M-T" 'calibredb-set-metadata--title
      "\M-c" 'calibredb-set-metadata--comments))
#+end_src
* 剪贴板
#+begin_src emacs-lisp
  (use-package simpleclip
    :defer
    :init
    (defun private/paste ()
      (interactive)
      (right-char)
      (simpleclip-paste))
    :general
    (general-define-key
     "s-c" 'simpleclip-copy
     "s-x" 'simpleclip-cut
     "s-v" 'private/paste))
#+end_src
* 使用 Server Client 方式启动 emacs
** 开机启动
   新建 plist 文件如下，然后使用 =launchctl start gnu.emacs.daemon= 激活。
   #+begin_src xml :tangle no
     <!-- save in ~/Library/LaunchAgents/gnu.emacs.daemon.plist-->
     <?xml version="1.0" encoding="UTF-8"?>
        <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
            "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
         <plist version="1.0">
          <dict>
            <key>Label</key>
            <string>gnu.emacs.daemon</string>
            <key>ProgramArguments</key>
            <array>
              <string>/usr/local/bin/emacs</string>
              <string>--daemon=kenton</string>
            </array>
           <key>RunAtLoad</key>
           <true/>
           <key>ServiceDescription</key>
           <string>Gnu Emacs Daemon</string>
          </dict>
        </plist>
   #+end_src
** 启动 frame
   使用 alfred workflow ，通过执行脚本的方式启动 frame 。注意，这个 frame 并没有初始化的时间。
   #+begin_src shell :tangle no
     /usr/local/bin/emacsclient --socket-name=kenton --no-wait -c
   #+end_src
** 关闭 frame
   这里有一个问题，默认的 =s-q= 快捷键是关闭 emacs ，这个行为会关闭 server ，影响我们这里的机制，所以需要重新定义。
   #+begin_src emacs-lisp
     (general-define-key
      "s-q" 'delete-frame)
   #+end_src
* 自动补全
  =smartparens= 暂时没有找到如何更改包裹，只找到另一个插件[[https://github.com/cute-jumper/embrace.el][embrace]] ，但暂时先不考虑。
  可以开始考虑 embrace 了。。。
#+begin_src emacs-lisp
  (use-package company
    :defer t
    :init
    (add-hook 'after-init-hook 'global-company-mode)
    (setq company-idle-delay 0.3
	  company-require-match 'never
	  company-tooltip-align-annotations t
	  company-dabbrev-downcase nil
	  company-dabbrev-ignore-case nil
	  company-minimum-prefix-length 1)
    (setq company-backend
	  '(company-keywords
	    company-elisp
	    company-files
	    company-yasnippet
	    company-capf
	    company-dabbrev-code
	    company-dabbrev))
    :config
    ;; ;; 使 org-mode 中的 company 可以补全代码 symbol
    ;; (push 'org-mode company-dabbrev-code-modes)
    :general
    (general-define-key
     :keymaps 'company-active-map
     "<tab>" 'company-complete-selection
     "<RET>" nil
     "<return>" nil
     "C-w" nil
     "C-n" 'company-select-next
     "C-p" 'company-select-previous))

  (use-package smartparens
    :hook (prog-mode . smartparens-mode)
    :hook (org-mode . smartparens-mode))

  (use-package yasnippet
    :defer t
    :hook (prog-mode . yas-minor-mode)
    :hook (org-mode . yas-minor-mode))

  (use-package yasnippet-snippets
    :defer t
    :hook (yas-minor-mode . yas-reload-all))
#+end_src
* prescient
  #+begin_src emacs-lisp
    (use-package prescient
      :after (ivy company)
      :config
      (setq prescient-filter-method 'regexp))

    (use-package ivy-prescient
      :after (prescient counsel)
      :hook (ivy-mode . ivy-prescient-mode)
      :config
      (setq ivy-prescient-retain-classic-highlighting t))

    (use-package company-prescient
      :after prescient
      :hook (company-mode . company-prescient-mode))

  #+end_src
* navigation
#+begin_src emacs-lisp
  (use-package avy
    :commands (avy-goto-char-2 avy-goto-line)
    :config
    (setq avy-all-windows nil
	  avy-background t)
    :general
    (common-leader
     "j" '(ignore t :which-key "jumping")
     "jj" 'avy-goto-char-2
     "jl" 'avy-goto-line))
#+end_src
* Projectile
默认 projectile 是对大小写敏感的，但 MacOS 默认并不敏感，所以可能会出现 projectile 里有两条一个大写一个小写的两条记录指向同一个项目，好难受。。。从 github 发现一个方法可以清理一下，注意，需要先 clear 所有记录才可以。
#+begin_src emacs-lisp
  (defun projectile-relevant-known-projects ()
    "Return a list of known projects except the current one (if present)."
    (if (projectile-project-p)

	(->> projectile-known-projects
	     (--reduce-from
	      (if (-contains? (-map 's-downcase acc) (s-downcase it)) acc (cons it acc))
	      (list (abbreviate-file-name (projectile-project-root))))
	     (-sort 'string-lessp))

      projectile-known-projects))

  (use-package projectile
    :init
    (add-hook 'after-init-hook 'projectile-mode)
    (setq project-cache-file "~/.emacs.d/projectile.cache"
	  project-know-projects-file "~/.emacs.d/projectile-bookmarks.eld"
	  projectile-project-search-path '("~/Kenton/")
	  projectile-completion-system 'ivy)
    :config
    (projectile-discover-projects-in-search-path)
    (projectile-relevant-known-projects))

  (use-package counsel-projectile
    :init
    (add-hook 'after-init-hook 'counsel-projectile-mode)
    :general
    (common-leader
     "pf" 'counsel-projectile-find-file
     "pl" 'counsel-projectile-switch-project))
#+end_src
