init.el

(use-package calibredb
  :defer t
  :quelpa (calibredb :fetcher github :repo "chenyanming/calibredb.el" :branch "develop")
  :commands (calibredb)
  :config
  (setq calibredb-size-show t
	;;calibredb-format-all-the-icons t
	calibredb-id-width 4
	calibredb-title-width 40
	calibredb-date-width 0
	calibredb-root-dir private/book-directory
	calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir)
	calibredb-library-alist '(private/book-directory))
  :general
  (local-leader
    :keymaps 'calibredb-show-mode-map
    "?" 'calibredb-entry-dispatch
    "o" 'calibredb-find-file
    "O" 'calibredb-find-file-other-frame
    "V" 'calibredb-open-file-with-default-tool
    "s" 'calibredb-set-metadata-dispatch
    "e" 'calibredb-export-dispatch
    "q" 'calibredb-entry-quit
    "y" 'calibredb-yank-dispatch
    "," 'calibredb-quick-look
    "." 'calibredb-open-dired
    "\M-/" 'calibredb-rga
    "\M-t" 'calibredb-set-metadata--tags
    "\M-a" 'calibredb-set-metadata--author_sort
    "\M-A" 'calibredb-set-metadata--authors
    "\M-T" 'calibredb-set-metadata--title
    "\M-c" 'calibredb-set-metadata--comments)
  (local-leader
    :keymaps 'calibredb-search-mode-map
    "<RET>" 'calibredb-find-file
    "?" 'calibredb-dispatch
    "a" 'calibredb-add
    "A" 'calibredb-add-dir
    "c" 'calibredb-clone
    "d" 'calibredb-remove
    "D" 'calibredb-remove-marked-items
    "j" 'calibredb-next-entry
    "k" 'calibredb-previous-entry
    "l" 'calibredb-virtual-library-list
    "L" 'calibredb-library-list
    "n" 'calibredb-virtual-library-next
    "N" 'calibredb-library-next
    "p" 'calibredb-virtual-library-previous
    "P" 'calibredb-library-previous
    "s" 'calibredb-set-metadata-dispatch
    "S" 'calibredb-switch-library
    "o" 'calibredb-find-file
    "O" 'calibredb-find-file-other-frame
    "v" 'calibredb-view
    "V" 'calibredb-open-file-with-default-tool
    "," 'calibredb-quick-look
    "." 'calibredb-open-dired
    "y" 'calibredb-yank-dispatch
    "b" 'calibredb-catalog-bib-dispatch
    "e" 'calibredb-export-dispatch
    "r" 'calibredb-search-refresh-and-clear-filter
    "R" 'calibredb-search-clear-filter
    "q" 'calibredb-search-quit
    "m" 'calibredb-mark-and-forward
    "f" 'calibredb-toggle-favorite-at-point
    "x" 'calibredb-toggle-archive-at-point
    "h" 'calibredb-toggle-highlight-at-point
    "u" 'calibredb-unmark-and-forward
    "i" 'calibredb-edit-annotation
    "<DEL>" 'calibredb-unmark-and-backward
    "<backtab>" 'calibredb-toggle-view
    "TAB" 'calibredb-toggle-view-at-point
    "\M-n" 'calibredb-show-next-entry
    "\M-p" 'calibredb-show-previous-entry
    "/" 'calibredb-search-live-filter
    "\M-t" 'calibredb-set-metadata--tags
    "\M-a" 'calibredb-set-metadata--author_sort
    "\M-A" 'calibredb-set-metadata--authors
    "\M-T" 'calibredb-set-metadata--title
    "\M-c" 'calibredb-set-metadata--comments))

(general-define-key
 "s-q" 'delete-frame)

(use-package company
  :defer t
  :init
  (add-hook 'after-init-hook 'global-company-mode)
  (setq company-idle-delay 0.3
	company-require-match 'never
	company-tooltip-align-annotations t
	company-dabbrev-downcase nil
	company-dabbrev-ignore-case nil
	company-minimum-prefix-length 1)
  (setq company-backend
	'(company-keywords
	  company-elisp
	  company-files
	  company-capf
	  company-yasnippet
	  company-dabbrev-code
	  company-dabbrev))
  :general
  (general-define-key
   :keymaps 'company-active-map
   "<tab>" 'company-complete-selection
   "<RET>" nil
   "<return>" nil
   "C-w" nil
   "C-n" 'company-select-next
   "C-p" 'company-select-previous))

(use-package smartparens
  :hook (prog-mode . smartparens-mode)
  :hook (org-mode . smartparens-mode))

(use-package yasnippet
  :defer t
  :hook (prog-mode . yas-minor-mode)
  :hook (org-mode . yas-minor-mode))

(use-package yasnippet-snippets
  :defer t
  :hook (yas-minor-mode . yas-reload-all))

(use-package prescient
  :after (ivy company)
  :config
  (setq prescient-filter-method 'regexp))

(use-package ivy-prescient
  :after (prescient counsel)
  :hook (ivy-mode . ivy-prescient-mode)
  :config
  (setq ivy-prescient-retain-classic-highlighting t))

(use-package company-prescient
  :after prescient
  :hook (company-mode . company-prescient-mode))

(use-package avy
  :commands (avy-goto-char-2 avy-goto-line)
  :config
  (setq avy-all-windows nil
	avy-background t)
  :general
  (common-leader
   "j" '(ignore t :which-key "jumping")
   "jj" 'avy-goto-char-2
   "jl" 'avy-goto-line))

(defun projectile-relevant-known-projects ()
  "Return a list of known projects except the current one (if present)."
  (if (projectile-project-p)

      (->> projectile-known-projects
	   (--reduce-from
	    (if (-contains? (-map 's-downcase acc) (s-downcase it)) acc (cons it acc))
	    (list (abbreviate-file-name (projectile-project-root))))
	   (-sort 'string-lessp))

    projectile-known-projects))

(use-package projectile
  :init
  (add-hook 'after-init-hook 'projectile-mode)
  (setq project-cache-file "~/.emacs.d/projectile.cache"
	project-know-projects-file "~/.emacs.d/projectile-bookmarks.eld"
	projectile-project-search-path '("~/Kenton/")
	projectile-completion-system 'ivy)
  :config
  (projectile-discover-projects-in-search-path)
  (projectile-relevant-known-projects))

(use-package counsel-projectile
  :init
  (add-hook 'after-init-hook 'counsel-projectile-mode)
  :general
  (common-leader
   "pf" 'counsel-projectile-find-file
   "pl" 'counsel-projectile-switch-project))
