init.el

(use-package magit
  :commands (magit-status magit-blame)
:after evil-collection
  :init
  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
(evil-collection-init)
  :general
  ;;(clear-spc
  ;;:keymaps
  ;;'(magit-mode-map
  ;;magit-status-mode-map
  ;;magit-diff-mode-map
  ;;magit-process-mode-map
  ;;magit-blame-read-only-mode-map
  ;;magit-log-mode-map
  ;;git-rebase-mode-map))
  (common-leader
    "gs" 'magit-status
    "gb" 'magit-blame
    "gi" 'vc-msg-show)

  (general-nmap
    :keymaps 'magit-mode-map
    "s-<return>" 'magit-diff-visit-file-other-window))

(use-package diff-hl
  :defer t
  :hook (prog-mode . diff-hl-flydiff-mode))

(use-package vc-msg
  :defer t
  :commands (vc-msg-show)
  :init
  (eval-after-load 'vc-msg-git
    '(progn
       ;; show code of commit
       (setq vc-msg-git-show-commit-function 'magit-show-commit)
       ;; open file of certain revision
       (push '("m"
	       "[m]agit-find-file"
	       (lambda ()
		 (let* ((info vc-msg-previous-commit-info)
			(git-dir (locate-dominating-file default-directory ".git")))
		   (magit-find-file (plist-get info :id )
				    (concat git-dir (plist-get info :filename))))))
	     vc-msg-git-extra))))

(use-package elixir-mode
  :defer t
  :config
  (add-hook 'elixir-mode-hook
	    (lambda() (add-hook 'before-save-hook 'elixir-format nil t)))

  (defun +reset-mixfmt-args ()
    (let* ((formatter-directory (locate-dominating-file default-directory ".formatter.exs"))
	   (formatter-file (concat formatter-directory ".formatter.exs")))
      (if formatter-directory
	  (setq elixir-format-arguments (list "--dot-formatter" formatter-file))
	(setq elixir-format-arguments nil))))

  (add-hook 'elixir-format-hook #'+reset-mixfmt-args))

(use-package exunit
  :defer t
  :after elixir-mode
  :config
  :commands (exunit-verify-all
	     exunit-verify
	     exunit-verify-all-in-umbrella
	     exunit-verify-single
	     exunit-rerun
	     exunit-toggle-file-and-test)
  :general
  (general-define-key
   :keymaps '(exunit-compilation-mode-map)
   "SPC" nil)
  (local-leader
    "t" '(:ignore t :which-key "test")
    "ta" 'exunit-verify-all
    "tt" 'exunit-verify-single
    "tb" 'exunit-verify
    "tr" 'exunit-rerun
    "tf" 'exunit-toggle-file-and-test
    ))

(use-package haskell-mode
  :defer t
  :init
  (add-hook 'haskell-mode-hook 'lsp)
  (add-hook 'haskell-literate-mode-hook 'lsp)
  :config
  (setq haskell-process-type 'stack-ghci))

(use-package lsp-haskell
  :defer t)

(use-package sly
  :defer t
  :init
  (setq inferior-lisp-program "/Users/smartepsh/.asdf/shims/sbcl"
	org-babel-lisp-eval-fn 'sly-eval))
