init.el

(use-package lsp-mode
  :defer t
  :init
  (setq lsp-keymap-prefix "s-l")
  (add-to-list 'exec-path (concat private/config-directory "elixir-ls"))
  :hook (elixir-mode . lsp)
  :hook (lsp-mode . lsp-enable-which-key-integration)
  :config
  (setq lsp-headerline-breadcrumb-enable nil
	lsp-file-watch-threshold 2000)
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.elixir_ls\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\deps\\'")
  :general
  (common-leader
   "." 'lsp-find-definition
   "," 'xref-pop-marker-stack))

(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
;;(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

(use-package flyspell
  :ensure-system-package hunspell
  :hook (text-mode . flyspell-mode)
  :hook (prog-mode . flyspell-prog-mode)
  :init
  (setenv "LANG" "en_US")
  (setq flyspell-issue-welcome-flag nil)
  :config
  (setq ispell-program-name (executable-find "hunspell")
	ispell-dictionary "en_US"
	ispell-local-dictionary-alist '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)))
  (global-set-key (kbd "C-c s") 'flyspell-learn-word-at-point)

  (defun flyspell-learn-word-at-point ()
    "Takes the highlighted word at point -- nominally a misspelling -- and inserts it into the personal/private dictionary, such that it is known and recognized as a valid word in the future."
    (interactive)
    (let ((current-location (point))
	  (word (flyspell-get-word)))
      (when (consp word)
	(flyspell-do-correct
	 'save nil
	 (car word)
	 current-location
	 (cadr word)
	 (caddr word)
	 current-location)))))

(use-package flyspell-correct-ivy
  :after flyspell-correct)

(use-package flyspell-correct
  :commands (flyspell-correct-wrapper)
  :init
  (setq flyspell-correct-interface 'flyspell-correct-ivy)
  :general
  (general-define-key
   :keymaps 'flyspell-mode-map
   "C-;" 'flyspell-correct-wrapper
   "C-," nil
   "C-'" 'flyspell-learn-word-at-point))

(use-package dired
  :ensure nil
  :ensure-system-package (gls . coreutils)
  :commands (dired-jump dired-jump-other-window)
  :init
  (setq dired-dwim-target t
	dired-listing-switches "-alh"
	insert-directory-program "gls"
	dired-use-ls-dired t)
  :general
;;(clear-spc
  ;;:keymaps 'dired-mode-map)
  (common-leader
   "fd" 'dired-jump
   "fD" 'dired-jump-other-window))

(use-package bm
  :init
