init_el.org
* 书签
#+begin_src emacs-lisp
(use-package bm
  :init
  ;; restore on load (even before you require bm)
  (setq bm-restore-repository-on-load t)
  :config
  ;; Allow cross-buffer 'next'
  (setq bm-cycle-all-buffers t)
  ;; where to store persistant files
  (setq bm-repository-file "~/.emacs.d/bms")
  ;; save bookmarks
  (setq-default bm-buffer-persistence t)
  ;; Loading the repository from file when on start up.
  (add-hook 'after-init-hook 'bm-repository-load)
  ;; Saving bookmarks
  (add-hook 'kill-buffer-hook #'bm-buffer-save)
  ;; Saving the repository to file when on exit.
  ;; kill-buffer-hook is not called when Emacs is killed, so we
  ;; must save all bookmarks first.
  (add-hook 'kill-emacs-hook #'(lambda nil
				 (bm-buffer-save-all)
				 (bm-repository-save)))
  ;; The `after-save-hook' is not necessary to use to achieve persistence,
  ;; but it makes the bookmark data in repository more in sync with the file
  ;; state.
  (add-hook 'after-save-hook #'bm-buffer-save)
  ;; Restoring bookmarks
  (add-hook 'find-file-hooks   #'bm-buffer-restore)
  (add-hook 'after-revert-hook #'bm-buffer-restore)
  ;; The `after-revert-hook' is not necessary to use to achieve persistence,
  ;; but it makes the bookmark data in repository more in sync with the file
  ;; state. This hook might cause trouble when using packages
  ;; that automatically reverts the buffer (like vc after a check-in).
  ;; This can easily be avoided if the package provides a hook that is
  ;; called before the buffer is reverted (like `vc-before-checkin-hook').
  ;; Then new bookmarks can be saved before the buffer is reverted.
  ;; Make sure bookmarks is saved before check-in (and revert-buffer)
  (add-hook 'vc-before-checkin-hook #'bm-buffer-save)
  :custom-face
  (bm-persistent-face ((t (:background "blue violet" :foreground "White"))))
  :general
  (general-define-key
    :keymaps 'bm-show-mode-map
    "<RET>" 'bm-show-goto-bookmark
    "<return>" 'bm-show-goto-bookmark)
  (common-leader
    "b" '(:ignore t :which-key "bookmarks")
    "ba" 'bm-bookmark-annotate
    "bb" 'bm-toggle
    "bj" 'bm-next
    "bk" 'bm-previous
    "bl" 'bm-show-all
    "bc" 'bm-remove-all-current-buffer
    "bn" 'bm-lifo-next
    "bp" 'bm-lifo-previous))
#+end_src
* 错误检查
  lsp-mode 推荐使用 flycheck ，那我们尝试简单配置一下。使用 posframe 显示信息。
  #+begin_src emacs-lisp
    (use-package flycheck
      :defer t
      :init
      (add-hook 'prog-mode-hook 'flycheck-mode)
      (add-hook 'flycheck-mode-hook 'flycheck-posframe-mode))

    (use-package flycheck-posframe
      :after flycheck)
  #+end_src
* Jira
#+begin_src emacs-lisp
  (use-package dash-functional)
  (use-package ejira
    :quelpa (ejira :fetcher github :repo "nyyManni/ejira" :branch "master")
    :init
    (setq jiralib2-url "https://choiceform.atlassian.net/"
          jiralib2-auth 'token
          jiralib2-user-login-name "kenton.wang@choiceform.com"
          jiralib2-token nil
          ejira-org-directory (concat org-directory "worklog/")
          ejira-projects '("CORE"))
    :config
    (require 'ejira-agenda))
#+end_src
* 废弃！！！
经过一段时间的试用，meow 虽然轻量了一些，但对 vi 造成的影响蛮大，而且他对于移动边界判定和 vi 不同，有点不太能适应。但他的 keypad 模式挺方便的，不过也有 god-mode 作为备选方案，所以决定放弃 meow 回到 evil 模式下。同时使用 god-mode 作为辅助，以减少 evil 的快捷键设定。
#+begin_src emacs-lisp :tangle no
  (defun meow-setup ()
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
    (meow-motion-overwrite-define-key
     '("j" . meow-next)
     '("k" . meow-prev)
     '("}" . scroll-up)
     '("{" . scroll-down))
    (meow-leader-define-key
     ;; SPC j/k will run the original command in MOTION state.
     '("j" . "H-j")
     '("k" . "H-k")
     ;; Use SPC (0-9) for digit arguments.
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     ;; '("/" . meow-keypad-describe-key)
     '("?" . meow-cheatsheet))
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . meow-append)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . meow-change)
     '("d" . meow-delete)
     '("D" . meow-backward-delete)
     '("e" . meow-next-word)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("G" . meow-grab)
     '("h" . meow-left)
     '("H" . meow-left-expand)
     '("i" . meow-insert)
     '("I" . meow-open-above)
     '("j" . meow-next)
     '("J" . meow-next-expand)
     '("k" . meow-prev)
     '("K" . meow-prev-expand)
     '("l" . meow-right)
     '("L" . meow-right-expand)
     '("m" . meow-join)
     '("n" . meow-search)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-yank)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("s" . meow-kill)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . meow-visit)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("X" . counsel-M-x)
     '("x" . meow-line)
     '("y" . meow-save)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("<escape>" . meow-cancel-selection)
     '("g" . mode-line-other-buffer)
     ;; customize
     '("P" . meow-yank-pop)
     '(":" . meow-goto-line)
     '("}" . scroll-up)
     '("{" . scroll-down)

     '("C-r" . undo-redo)
     '("'" . meow-start-kmacro-or-insert-counter)
     '("%" . meow-query-replace-regexp)
     '("\"" . meow-end-or-call-kmacro)))
  ;; '("C" . meow--save)
  ;; '("F" . meow-find-expand)
  ;; '("N" . meow-pop-search)
  ;; '("T" . meow-till-expand)
  ;; '("V" . meow-kmacro-psave)
  ;; '("X" . meow-kmacro-lines)
  ;; '("Z" . meow-pop-all-selection)
  ;; '("&" . meow-query-replace)
  ;; '("'" . repeat)
  ;; '("\\" . quotesaved-insert)
  ;; '("g" . meow-last-savesave)
  ;; '("S" . meow-repaaaaaaaaaaaaaaaaceaaaa-save)))

  (use-package meow
    :demand t
    :init
    (setq meow-use-cursor-position-hack t
	  meow-use-enhanced-selection-effect t)
    (meow-global-mode t)
    :config
    (meow-setup)
    (add-to-list 'meow-mode-state-list '(sly-mrepl-mode . normal))
    (setq meow-expand-exclude-mode-list '()
	  meow-selection-command-fallback
	  '((meow-change . meow-change-char)
	    (meow-replace . meow-replace-char)
	    (meow-save . meow-save-char)
	    (meow-kill . meow-C-k)
	    (meow-cancel-selection . meow-keyboard-quit)
	    (meow-pop-selection . meow-pop-grab)
	    (meow-beacon-change . meow-beacon-change-char))))
#+end_src
